---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.TopOrExterior
enum: Autodesk.Revit.DB.Structure.ReinforcementBarOrientation
source: html/b67e1240-752a-316d-0e41-2000d19aa088.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.TopOrExterior

The major segment of the bar is on the top face (of a floor/slab) or the exterior face (of a wall).